sellist/app/controllers/shopify/main_controller.rb

SELECT "shopify_shops".* FROM "shopify_shops" WHERE "shopify_shops"."brand_detail_id" = $1 ORDER BY "shopify_shops"."updated_at" ASC  [["brand_detail_id", 2]]
---
  def index
    brand = current_user.brand_detail
    @shopify_shops = brand.shopify_shops.order(:updated_at)