sellist/app/controllers/seller/items_controller.rb

  def index
    session[:catg_id] = ''
    session[:sub_catg_id] = ''
    session[:prod_catg_id] = ''
    seller_items = Item.joins(:seller_items).where("seller_id = ?", current_user.id)
    @seller_items = seller_items.where("discontinued = ?", false).paginate(page: params[:page], per_page: 10)
---
SELECT "items".* FROM "items" INNER JOIN "seller_items" ON "seller_items"."item_id" = "items"."id" WHERE (seller_id = 3)
SELECT  "items".* FROM "items" INNER JOIN "seller_items" ON "seller_items"."item_id" = "items"."id" WHERE (seller_id = 3) AND (discontinued = 'f') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]